Ebiroll/esp32_sigrok/main/collector.c
#include <stdbool.h>
#include <stdio.h>
#include "analog.h"
#include <string.h>
#include <sys/param.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "collector.h"
#include "driver/ledc.h"

#ifdef CONFIG_IDF_TARGET_ESP32
#define LEDC_HS_TIMER          LEDC_TIMER_0
#define LEDC_HS_MODE           LEDC_HIGH_SPEED_MODE
#define LEDC_HS_CH0_GPIO       (18)
#define LEDC_HS_CH0_CHANNEL    LEDC_CHANNEL_0
#define LEDC_HS_CH1_GPIO       (19)
#define LEDC_HS_CH1_CHANNEL    LEDC_CHANNEL_1
#endif
#define LEDC_LS_TIMER          LEDC_TIMER_1
#define LEDC_LS_MODE           LEDC_LOW_SPEED_MODE
#ifdef CONFIG_IDF_TARGET_ESP32S2
#define LEDC_LS_CH0_GPIO       (18)
#define LEDC_LS_CH0_CHANNEL    LEDC_CHANNEL_0
#define LEDC_LS_CH1_GPIO       (19)
#define LEDC_LS_CH1_CHANNEL    LEDC_CHANNEL_1
#endif


//#include "esp_netif.h"
#if 0

void setup(void);


static const char *TAG = "example";
static const char *payload = "Message from ESP32 ";

#define RECEIVER_PORT_NUM 6001
#define SENDER_PORT_NUM 6000

uint16_t trigger = 0;

int trig_pin;
// #define NUM_SAMPLES 14000

static int maxSamples=NUM_SAMPLES;
int stop_at_desc=-1;
unsigned int logicIndex = 0;
unsigned int triggerIndex = 0;
uint32_t readCount = CAPTURE_SIZE;
unsigned int delayCount = 0;
uint16_t trigger_values = 0;
unsigned int useMicro = 0;
unsigned int delayTime = 0;
unsigned long divider = 0;
uint32_t clock_per_read = 0;

camera_state_t *s_state;

static i2s_parallel_state_t* i2s_state[2] = {NULL, NULL};

bool ledPinVal=false;
int isRcounter=0;
intr_handle_t isrHandle;

static void IRAM_ATTR i2s_trigger_isr(void) {

  if (ledPinVal)
     gpio_set_level(ledPin, 1);
     else
     gpio_set_level(ledPin, 0);

  ledPinVal=!ledPinVal;
  isRcounter++;

  //I2S0.conf.rx_start = 1;

  I2S0.int_clr.val = I2S0.int_raw.val;   
}

void setupSimple(void) ;

void dma_serializer( dma_elem_t *dma_buffer ){
  for ( int i = 0 ; i < s_state->dma_buf_width/4 ; i++ ){
     uint8_t y =  dma_buffer[i].sample2;
     dma_buffer[i].sample2 = dma_buffer[i].sample1;
     dma_buffer[i].sample1 = y;
   }
}

i2s_parallel_buffer_desc_t bufdesc;


// This task sends data
#if 0
static void udp_sender(void *pvParameters)
{
    char host_ip[] = HOST_IP_ADDR;
    int addr_family = 0;
    int ip_protocol = 0;
    // This will stress all clients on your wifi network
    #define RECEIVER_IP_ADDR "255.255.255.255"

    while (1) {

        struct sockaddr_in dest_addr;
        dest_addr.sin_addr.s_addr = inet_addr(RECEIVER_IP_ADDR);
        dest_addr.sin_family = AF_INET;
        dest_addr.sin_port = htons(RECEIVER_PORT_NUM);
        addr_family = PF_INET;
        ip_protocol = IPPROTO_IP;

        //struct sockaddr_in6 dest_addr = { 0 };
        //ESP_ERROR_CHECK(get_addr_from_stdin(PORT, SOCK_DGRAM, &ip_protocol, &addr_family, &dest_addr));



        int sock = socket(addr_family, SOCK_DGRAM, ip_protocol);
        if (sock < 0) {
            ESP_LOGE(TAG, "Unable to create socket: errno %d", errno);
            break;
        }
        ESP_LOGI(TAG, "Socket created, sending to %s:%d", HOST_IP_ADDR, PORT);


        //#define sendto(s,dataptr,size,flags,to,tolen)     lwip_sendto_r(s,dataptr,size,flags,to,tolen)
        while (1) {

            int err = sendto(sock, payload, strlen(payload), 0, (struct sockaddr *)&dest_addr, sizeof(dest_addr));
            if (err < 0) {
                ESP_LOGE(TAG, "Error occurred during sending: errno %d", errno);
                break;
            }
            ESP_LOGI(TAG, "Message sent");

            vTaskDelay(2000 / portTICK_PERIOD_MS);
        }

        if (sock != -1) {
            ESP_LOGE(TAG, "Shutting down socket and restarting...");
            shutdown(sock, 0);
            close(sock);
        }
    }
    vTaskDelete(NULL);
}
/*
Raw/UDP

struct udp_pcb * udp_new(void)
Creates a new UDP pcb which can be used for UDP communication. The pcb is not active until it has either been bound to a local address or connected to a remote address.

void udp_remove(struct udp_pcb * pcb)
Removes and deallocates the pcb.

err_t udp_bind(struct udp_pcb * pcb, struct ip_addr * ipaddr, u16_t port)
Binds the pcb to a local address. The IP-address argument "ipaddr" can be IP_ADDR_ANY to indicate that it should listen to any local IP address. The function returns ERR_USE if the specified port is already in use, otherwise ERR_OK.

err_t udp_connect(struct udp_pcb * pcb, struct ip_addr * ipaddr, u16_t port)
Sets the remote end of the pcb. This function does not generate any network traffic, but only set the remote address of the pcb. It binds the pcb to a local address if it is not already bound. It returns ERR_USE if no port is available, ERR_RTE if there is no route to the destination, or ERR_OK. Connecting is only needed when using udp_send(). For unconnected pcbs, udp_sendto() can be used to send to any specified remote address. Connected pcbs only receive data from the connected remote address, while unconnected pcbs receive datagrams from any remote address.

void udp_disconnect(struct udp_pcb * pcb)
Remove the remote end of the pcb. This function does not generate any network traffic, but only removes the remote address of the pcb.

err_t udp_send(struct udp_pcb * pcb, struct pbuf * p)
Sends the pbuf p to the remote address set using udp_connect(). The pbuf is not deallocated.

err_t udp_sendto(struct udp_pcb *pcb, struct pbuf *p, struct ip_addr *dst_ip, u16_t dst_port);
Same as udp_send(), but sends to any remote address.

void udp_recv(struct udp_pcb * pcb,
               void (* recv)(void * arg, struct udp_pcb * upcb,
                                         struct pbuf * p,
                                         struct ip_addr * addr,
                                         u16_t port),
               void * recv_arg)
Specifies a callback function that should be called when a UDP datagram is received on the specified connection. The callback function is responsible for deallocating the pbuf.
*/
#endif 
/*
This example shows how to send some UDP data to UDP port 7000 on a remote host with IP address 10.0.0.1.
Send the data in the netbuf buf on the UDP connection conn. The data in the netbuf should not be too large if IP fragmentation support is disabled. If IP fragmentation support is disabled, the data should not be larger than the maximum transmission unit (MTU) of the outgoing network interface, less the space required for link layer, IP and UDP headers. No checking is necessarily made of whether the data is sufficiently small and sending very large netbufs might give undefined results.
int
main()
{
    struct netconn *conn;
    struct netbuf *buf;
    struct ip_addr addr;
    char *data;
    char text[] = "A static text";
    int i;

    // create a new connection 
    conn = netconn_new(NETCONN_UDP);

    // set up the IP address of the remote host 
    addr.addr = htonl(0x0a000001);

    // connect the connection to the remote host 
    netconn_connect(conn, addr, 7000);

    // create a new netbuf 
    buf = netbuf_new();
    data = netbuf_alloc(buf, 10);

