Ebiroll/esp32_sigrok/main/collector.c
    // create some arbitrary data 
    for(i = 0; i < 10; i++)
        data[i] = i;

    // send the arbitrary data 
    netconn_send(conn, buf);

    // reference the text into the netbuf 
    netbuf_ref(buf, text, sizeof(text));

    // send the text 
    netconn_send(conn, buf);

    // deallocate connection and netbuf 
    netconn_delete(conn);
    netconn_delete(buf);
}
*/

// We preallocate
// Start sending received buffers as fast as possible

void initUDP() {
 /* Start sending like a madlad */
 //xTaskCreate(udp_sender, "udp_sender", 4096, NULL, 5, NULL);
}

void initNormal() {


}

void set_mem_depth(int depth) {
    if (depth<NUM_SAMPLES) {
        maxSamples=depth;
    }
}


int stop_aq=false;
void stop_aquisition() {
    stop_aq=true;
}
// 1400/4
DMA_ATTR uint32_t dma_buff[2][350];
DMA_ATTR lldesc_t dma_descriptor[2];


void setupDelay(float timescale) {
  double rate = 1000.0 / timescale ;
  enable_out_clock((int)rate);
  printf("Capture Speed : %.2f Khz\r\n", rate/1000.0);
}

void setTimescale(float scale){
/*
  for(uint8_t i = 0; i<sizeof(dma_buff[0])/2; i++) {
      printf("%d",*(((uint16_t *)&dma_buff[0][0]) + i));
      printf(' ');
      //delay(10);
    }
*/
  setupDelay(scale);
  printf("setTimescale=%.3f\n",scale);

}

void captureData() {
  uint32_t a, b, c, d;
  printf("<====> DMA INT Number %d Status 0x%x \n", isRcounter, I2S0.int_raw.val);


  /*
  printf("FreeHeap         :%u\r\n", getFreeHeap());
  printf("FreeHeap 64 Byte :%u\r\n", heap_caps_get_largest_free_block(64) );
  printf("Triger Values 0x%X\r\n", trigger_values);
  printf("Triger        0x%X\r\n", trigger);
  printf("Running on CORE #%d\r\n", xPortGetCoreID());
  printf("Reading %d Samples\r\n", readCount);
  */
  //gpio_set_level(ledPin, 1);

  //ESP_LOGD(TAG, "dma_sample_count: %d", s_state->dma_sample_count);
  //start_dma_capture();

  //while (! s_state->dma_done ) 
  //  vTaskDelay(100 / portTICK_PERIOD_MS);
		

  taskYIELD();

  //gpio_set_level(ledPin, 0);

#if 0
  printf("ReadCount:  %d\r\n",readCount);
  printf("DMA Desc Current: %d\r\n",  s_state->dma_desc_cur);

  ESP_LOGD(TAG, "Copying buffer.");

  int filled_desc = ((readCount/2) / s_state->dma_sample_per_desc);
  int filled_sample_offset = ((readCount/2) % s_state->dma_sample_per_desc); //((readCount - 1) % s_state->dma_val_per_desc) % s_state->dma_sample_per_desc;
  int filled_full_sample_offset = s_state->dma_sample_per_desc;
  
  int tx_count = 0;
  printf("used_desc = %d\r\n", filled_desc);
  printf("used_sample_offset = %d\r\n", filled_sample_offset);  
  printf( "\r\nDone\r\n" );
  //flush();
  filled_desc--;
  filled_full_sample_offset--;
  if( filled_sample_offset-- == 0)
    filled_sample_offset = filled_full_sample_offset;


/*
  dma_elem_t cur;

  printf("\r\nRAW BlocX \r\n");
  for ( int i = 0 ; i < 100 ; i++ ){
     cur = (dma_elem_t&)s_state->dma_buf[0][i];
     printf("0x%X, ", cur.sample2);
     printf("0x%X, ", cur.sample1);
   }

  printf("\r\nRAW Block InpuX:\r\n");
  for ( int i = 0 ; i < 400 ; i+=2 ){
     uint8_t *crx = (uint8_t*)s_state->dma_buf[0];
     printf("0x%X, ", *(crx+i) );
     }
   println();
*/


  if(s_state->dma_desc_triggered < 0){ //if not triggered mode,
    s_state->dma_desc_triggered=0;  //first desc is 0
      ESP_LOGD(TAG, "Normal TX");
    }
  else
  {
    ESP_LOGD(TAG, "Triggered TX");
  }

/*
    for(int i=0; i<32 ; i++){
     printf("Processing DMA Desc: %d", i);
     fast_rle_block_encode_asm( (uint8_t*)s_state->dma_buf[i], s_state->dma_buf_width);
     if( rle_buff_p-rle_buff > rle_size - 4000 )
      break;
     }
*/   
#endif

//brexit:
  //ESP_LOGD(TAG, "End. TX: %d", tx_count);
  //gpio_set_level(ledPin, 0);
}


void start_sampling(){

  gpio_set_direction(ledPin, GPIO_MODE_OUTPUT);

  printf( "DMA INT Number %d Status 0x%x \n", isRcounter, I2S0.int_raw.val);
  setupSimple();

  // Check difference
  //setup();
  //enable_out_clock(1000000);
  printf("<== 0 ==> DMA INT Number %d Status 0x%x \n", isRcounter, I2S0.int_raw.val);

  //I2S0.conf.rx_start = 1;

  printf("<== 1 ==> DMA INT Number %d Status 0x%x \n", isRcounter, I2S0.int_raw.val);


  //captureData();
  //setupSimple();
}

bool samples_finnished() 
{
  return true;
}


void start_dma_capture(void) {
  s_state->dma_done = false;
  s_state->dma_desc_cur = 0;
  s_state->dma_received_count = 0;
  s_state->dma_filtered_count = 0;
  s_state->dma_desc_triggered = 0;

  ESP_ERROR_CHECK(esp_intr_disable(s_state->i2s_intr_handle));
  i2s_conf_reset();

  I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[0];
  I2S0.in_link.start = 1;
  I2S0.int_clr.val = I2S0.int_raw.val;

  I2S0.int_ena.val = 0;
  I2S0.int_ena.in_done = 1;

  ESP_LOGD(TAG, "DMA Tigger : 0x%X", trigger );
  if (trigger ) {
    stop_at_desc = -1;
    I2S0.rx_eof_num = s_state->dma_buf_width;
    I2S0.int_ena.in_suc_eof = 0;
    I2S0.int_ena.rx_take_data = 0;
    lldesc_t* pd = &s_state->dma_desc[s_state->dma_desc_count - 1];
    pd->eof = 0;
    pd->qe.stqe_next = &s_state->dma_desc[0];
  }
  else {
    s_state->dma_desc_triggered=-1;
    I2S0.rx_eof_num = readCount/2;
    I2S0.int_ena.in_suc_eof = 1;
    I2S0.int_ena.rx_take_data = 1;
    lldesc_t* pd = &s_state->dma_desc[s_state->dma_desc_count - 1];
    pd->eof = 1;
    pd->qe.stqe_next = 0x0;
  }

  //clear dma buffers
  for (int i = 0; i < s_state->dma_desc_count; ++i)
    memset( s_state->dma_buf[i], 0, s_state->dma_desc[i].length);

  //Enable the Interrupt
  ESP_ERROR_CHECK(esp_intr_enable(s_state->i2s_intr_handle));

  //attachInterrupt(0, i2s_trigger_isr, RISING);
  I2S0.conf.rx_start = 1;
}

static esp_err_t dma_desc_init(int raw_byte_size){
    s_state = (camera_state_t*) malloc (sizeof(camera_state_t));
    assert(raw_byte_size % 4 == 0);

    ESP_LOGD(TAG, "Buffer Total (for DMA): %d bytes", raw_byte_size);
    size_t dma_desc_count = 1;
    size_t buf_size = raw_byte_size;
    /*
    while (buf_size >= 4096)
    {
        buf_size /= 2;
        dma_desc_count *= 2;
    }
    s_state->dma_buf_width = buf_size;
    s_state->dma_val_per_desc = buf_size/2;
    s_state->dma_sample_per_desc = buf_size/4;
    s_state->dma_desc_count = dma_desc_count;
*/
    s_state->dma_buf_width = buf_size = 4000;
    s_state->dma_val_per_desc = 2000;
    s_state->dma_sample_per_desc = 1000;
    s_state->dma_desc_count = dma_desc_count = raw_byte_size/4000;
    
