Ebiroll/esp32_sigrok/main/collector.c
    ESP_LOGD(TAG, "DMA buffer size: %d", buf_size);
    ESP_LOGD(TAG, "DMA buffer count: %d", dma_desc_count);
    ESP_LOGD(TAG, "DMA buffer total: %d bytes", buf_size * dma_desc_count);
    
    s_state->dma_buf = (dma_elem_t**) malloc(sizeof(dma_elem_t*) * dma_desc_count);
    if (s_state->dma_buf == NULL) {
        return ESP_ERR_NO_MEM;
    }
    s_state->dma_desc = (lldesc_t*) malloc(sizeof(lldesc_t) * dma_desc_count);
    if (s_state->dma_desc == NULL) {
        return ESP_ERR_NO_MEM;
    }
    size_t dma_sample_count = 0;
    for (int i = 0; i < dma_desc_count; ++i) {
        ESP_LOGD(TAG, "Allocating DMA buffer #%d, size=%d", i, buf_size);
        dma_elem_t* buf = (dma_elem_t*) malloc(buf_size);
        if (buf == NULL) {
            ESP_LOGD(TAG, "NO_MEM!");  
            return ESP_ERR_NO_MEM;
        }
        s_state->dma_buf[i] = buf;
        ESP_LOGV(TAG, "dma_buf[%d]=%p", i, buf);

        lldesc_t* pd = &s_state->dma_desc[i];
        pd->length = buf_size/2;
        dma_sample_count += buf_size / 2; // indeed /4 because each sample is 4 bytes
        pd->size = buf_size;
        pd->owner = 1;
        pd->sosf = 1;
        pd->buf = (uint8_t*) buf;
        pd->offset = 0;
        pd->empty = 0;
        pd->eof = 0;
        pd->qe.stqe_next = &s_state->dma_desc[(i + 1) % dma_desc_count];
        if( i+1 == dma_desc_count ){
           pd->eof = 1;
           pd->qe.stqe_next = 0x0;
           //pd->eof = 0;
           //pd->qe.stqe_next = &s_state->dma_desc[0];
          }
    }
    s_state->dma_done = false;
    s_state->dma_sample_count = dma_sample_count;
    ESP_LOGD(TAG, "DMA dma_sample_count: %d", dma_sample_count);
    return ESP_OK;
}

static void gpio_setup_in(int gpio, int sig, int inv) {
  if (gpio == -1) return;
  PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[gpio], PIN_FUNC_GPIO);
  gpio_set_direction( (gpio_num_t)gpio, (gpio_mode_t)GPIO_MODE_DEF_INPUT);
  //gpio_matrix_in(gpio, sig, inv, false);
  gpio_matrix_in(gpio, sig, false);
}



void i2s_conf_reset(){
  // Toggle some reset bits in LC_CONF register
  I2S0.lc_conf.in_rst = 1;
  I2S0.lc_conf.in_rst = 0;
  I2S0.lc_conf.ahbm_rst = 1;
  I2S0.lc_conf.ahbm_rst = 0;
  I2S0.lc_conf.ahbm_fifo_rst = 1;
  I2S0.lc_conf.ahbm_fifo_rst = 0;

  // Toggle some reset bits in CONF register
  I2S0.conf.rx_reset = 1;
  I2S0.conf.rx_reset = 0;
  I2S0.conf.rx_fifo_reset = 1;
  I2S0.conf.rx_fifo_reset = 0;
  I2S0.conf.tx_reset = 1;
  I2S0.conf.tx_reset = 0;
  I2S0.conf.tx_fifo_reset = 1;
  I2S0.conf.tx_fifo_reset = 0;
  while (I2S0.state.rx_fifo_reset_back) {}
  }

/*
static void IRAM_ATTR iggr_isr(void* arg)
{
    I2S0.int_clr.val = I2S0.int_raw.val;
    bool need_yield;
    signal_dma_buf_received(&need_yield);
    ESP_EARLY_LOGV(TAG, "isr, cnt=%d", s_state->dma_received_count);
    if (s_state->dma_received_count == s_state->height * s_state->dma_per_line) {
        i2s_stop();
    }
    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}
*/

static void IRAM_ATTR i2s_isr(void* arg) {
  if(trigger==0){
    printf("DMA INT Number %d Status 0x%x", s_state->dma_desc_cur, I2S0.int_raw.val );
  
     /*
     ESP_LOGD(TAG, "DMA INT take_data? %d", I2S0.int_raw.rx_take_data );
     ESP_LOGD(TAG, "DMA INT in_dscr_empty? %d", I2S0.int_raw.in_dscr_empty );
     ESP_LOGD(TAG, "DMA INT in_done? %d", I2S0.int_raw.in_done );
     ESP_LOGD(TAG, "DMA INT in_suc_eof? %d", I2S0.int_raw.in_suc_eof );
     ESP_LOGD(TAG, "DMA INT rx_rempty? %d", I2S0.int_raw.rx_rempty );
     ESP_LOGD( "\r\n" );
     */
  
    //ESP_LOGD(TAG, "Executing DMA ISR on core %d", xPortGetCoreID() );
  }
  
  //gpio_set_level(, 1); //Should show a pulse on the logic analyzer when an interrupt occurs
  //gpio_set_level(, 0);
  if(I2S0.int_raw.in_done){ //filled desc
        
    if (stop_at_desc==-1){
        ESP_LOGD(TAG, "DMA INT Number %d Status 0x%x ", s_state->dma_desc_cur, I2S0.int_raw.val);


        stop_at_desc= (s_state->dma_desc_cur + (readCount / (s_state->dma_buf_width/2))-1) % s_state->dma_desc_count;
        ESP_LOGD(TAG, "DMA BREAK! Stop at desc %d", stop_at_desc);
        
        s_state->dma_desc_triggered = s_state->dma_desc_cur;
        I2S0.rx_eof_num = readCount/2 ;//- s_state->dma_buf_width/4000; // Total capacity - desc capacity
        I2S0.int_ena.in_suc_eof = 1;
        }        
        trigger=0;
        I2S0.int_clr.val = I2S0.int_raw.val;
       s_state->dma_desc_cur++;
    }

    
//s_state->dma_desc_cur=0;
esp_intr_disable(s_state->i2s_intr_handle);
i2s_conf_reset();
I2S0.conf.rx_start = 0;
s_state->dma_done = true;
 
  I2S0.int_clr.val = I2S0.int_raw.val;   
}


void i2s_parallel_setup(const i2s_parallel_config_t *cfg) {

  //Figure out which signal numbers to use for routing
  ESP_LOGI(TAG, "Setting up parallel I2S bus at I2S%d\n", 0);
  int sig_data_base, sig_clk;

  sig_data_base = I2S0I_DATA_IN0_IDX;
  sig_clk       = I2S0I_WS_IN_IDX;
  //sig_clk       = I2S0I_BCK_IN_IDX;

  //Route the signals
  gpio_setup_in(cfg->gpio_bus[0], sig_data_base + 0, false); // D0
  gpio_setup_in(cfg->gpio_bus[1], sig_data_base + 1, false); // D1
  gpio_setup_in(cfg->gpio_bus[2], sig_data_base + 2, false); // D2
  gpio_setup_in(cfg->gpio_bus[3], sig_data_base + 3, false); // D3
  gpio_setup_in(cfg->gpio_bus[4], sig_data_base + 4, false); // HS
  gpio_setup_in(cfg->gpio_bus[5], sig_data_base + 5, false); // VS
  gpio_setup_in(cfg->gpio_bus[6], sig_data_base + 6, false); // VS
  gpio_setup_in(cfg->gpio_bus[7], sig_data_base + 7, false); // VS

  gpio_setup_in(cfg->gpio_bus[8], sig_data_base + 8, false); // VS
  gpio_setup_in(cfg->gpio_bus[9], sig_data_base + 9, false); // VS
  gpio_setup_in(cfg->gpio_bus[10], sig_data_base + 10, false); // VS
  gpio_setup_in(cfg->gpio_bus[11], sig_data_base + 11, false); // VS
  gpio_setup_in(cfg->gpio_bus[12], sig_data_base + 12, false); // VS
  gpio_setup_in(cfg->gpio_bus[13], sig_data_base + 13, false); // VS
  gpio_setup_in(cfg->gpio_bus[14], sig_data_base + 14, false); // VS
  gpio_setup_in(cfg->gpio_bus[15], sig_data_base + 15, false); // VS

