Ebiroll/esp32_sigrok/main/collector.c
  gpio_setup_in(cfg->gpio_clk, sig_clk, false);
//gpio_matrix_in(0x38,    I2S0I_WS_IN_IDX, false);

  gpio_matrix_in(0x38,    I2S0I_V_SYNC_IDX, false);
  gpio_matrix_in(0x38,    I2S0I_H_SYNC_IDX, false);
  gpio_matrix_in(0x38,    I2S0I_H_ENABLE_IDX, false);

  // Enable and configure I2S peripheral
  periph_module_enable(PERIPH_I2S0_MODULE);
  
  
  
  //Initialize I2S dev
  // Toggle some reset bits in LC_CONF register
  // Toggle some reset bits in CONF register
  i2s_conf_reset();
    
  // Enable slave mode (sampling clock is external)
  I2S0.conf.rx_slave_mod = 1;

  //Enable LCD mode
  I2S0.conf2.val = 0;

  // Enable parallel mode
  I2S0.conf2.lcd_en = 1;
  
  // Use HSYNC/VSYNC/HREF to control sampling
  I2S0.conf2.camera_en = 1;

  // f i2s = fpll / (Num + b/a )) where fpll=80Mhz
  // Configure clock divider
  I2S0.clkm_conf.val = 0;

  I2S0.clkm_conf.clka_en = 0;    // select PLL_D2_CLK. Digital Multiplexer that select between APLL_CLK or PLL_D2_CLK.
  //I2S0.clkm_conf.clk_en = 1;
  
  
  I2S0.clkm_conf.clkm_div_a = 1;
  I2S0.clkm_conf.clkm_div_b = 0;
  I2S0.clkm_conf.clkm_div_num = 4;
  
  /*
  I2S0.clkm_conf.clkm_div_a = 3;//  24Mhz
  I2S0.clkm_conf.clkm_div_b = 1;
  I2S0.clkm_conf.clkm_div_num = 3;
  */
  
  // FIFO will sink data to DMA
  I2S0.fifo_conf.dscr_en = 1;
  
  // FIFO configuration
  //I2S0.fifo_conf.rx_fifo_mod = s_state->sampling_mode;
  I2S0.fifo_conf.rx_fifo_mod = 1;// SM_0A0B_0C0D = 1,
  I2S0.fifo_conf.rx_fifo_mod_force_en = 1;
  //dev->conf_chan.val = 0;
  I2S0.conf_chan.rx_chan_mod = 1;
  
  // Clear flags which are used in I2S serial mode
  I2S0.sample_rate_conf.rx_bits_mod = 0;
  I2S0.conf.rx_right_first = 1;
  I2S0.conf.rx_msb_right = 0;
  I2S0.conf.rx_msb_shift = 0;
  I2S0.conf.rx_mono = 1;
  I2S0.conf.rx_short_sync = 1;
//  I2S0.conf.rx_mono = 0;
//  I2S0.conf.rx_short_sync = 0;
  I2S0.timing.val = 0;
//  I2S0.timing.rx_dsync_sw = 1;

  I2S0.sample_rate_conf.val = 0;
  // Clear flags which are used in I2S serial mode
  //I2S0.sample_rate_conf.rx_bits_mod = 8;
  I2S0.sample_rate_conf.rx_bits_mod = 16;
  //dev->sample_rate_conf.rx_bck_div_num = 16; //ToDo: Unsure about what this does...
  I2S0.sample_rate_conf.rx_bck_div_num = 1;  // datasheet says this must be 2 or greater (but 1 seems to work)
  
  // this combination is 20MHz
  //dev->sample_rate_conf.tx_bck_div_num=1;
  //dev->clkm_conf.clkm_div_num=3; // datasheet says this must be 2 or greater (but lower values seem to work)

  //Allocate DMA descriptors
  i2s_state[0] = (i2s_parallel_state_t*)malloc(sizeof(i2s_parallel_state_t));
  i2s_parallel_state_t *st = i2s_state[0];
  
  s_state->dma_done = false;
  s_state->dma_desc_cur = 0;
  s_state->dma_received_count = 0;
  s_state->dma_filtered_count = 0;
  //esp_intr_disable(s_state->i2s_intr_handle);
  // i2s_conf_reset();


  ESP_LOGD(TAG, "dma_sample_count: %d", s_state->dma_sample_count);
  I2S0.rx_eof_num = s_state->dma_sample_count;
  I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[0];
  I2S0.in_link.start = 1;
  I2S0.int_clr.val = I2S0.int_raw.val;
  I2S0.int_ena.val = 0;

  //Setup I2S DMA Interrupt
  esp_err_t err = esp_intr_alloc( ETS_I2S0_INTR_SOURCE,
                    ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_IRAM,
                    &i2s_isr,  NULL, &s_state->i2s_intr_handle );
  
  //Enable the Interrupt
  //ESP_ERROR_CHECK(esp_intr_enable(s_state->i2s_intr_handle));
  
  I2S0.int_ena.in_done = 1;


//  I2S0.conf.rx_start = 1;
}

void enable_out_clock( int freq_in_hz ) {
    //ledcSetup(0, freq_in_hz, 1);
    //ledcAttachPin(16 0);
    //ledcWrite( 0, 1);
    //delay(10);

    ledc_timer_config_t ledc_timer = {
        .duty_resolution = LEDC_TIMER_1_BIT, // resolution of PWM duty
        .freq_hz = freq_in_hz,                      // frequency of PWM signal
        .speed_mode = LEDC_HS_MODE,           // timer mode
        .timer_num = LEDC_HS_TIMER,            // timer index
        .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
    };
    // Set configuration of timer0 for high speed channels
    ledc_timer_config(&ledc_timer);


#if defined CONFIG_IDF_TARGET_ESP32S2
        {
            .channel    = LEDC_LS_CH0_CHANNEL,
            .duty       = 0,
            .gpio_num   = LEDC_LS_CH0_GPIO,
            .speed_mode = LEDC_LS_MODE,
            .hpoint     = 0,
            .timer_sel  = LEDC_LS_TIMER
        },
#endif
    ledc_channel_config_t ledc_channel = 
        {
            .channel    = LEDC_HS_CH0_CHANNEL,
            .duty       = 1,
            .gpio_num   = 16,
            .speed_mode = LEDC_HS_MODE,
            .hpoint     = 0,
            .timer_sel  = LEDC_HS_TIMER
        };

   ledc_channel_config(&ledc_channel);

    #if 0
    esp_err_t err;
    periph_module_enable(PERIPH_LEDC_MODULE);
    ledc_timer_config_t timer_conf;
    // Name change... timer_conf.bit_num = LEDC_TIMER_1_BIT;
    //timer_conf.timer_num  = LEDC_TIMER_3;
    #if ESP_IDF_VERSION_MAJOR >= 4 && ESP_IDF_VERSION_MINOR >= 1
    timer_conf.clk_cfg = LEDC_AUTO_CLK;
    #endif
    timer_conf.clk_cfg = LEDC_AUTO_CLK;
    timer_conf.duty_resolution    = 1;
    //timer_conf.freq_hz = I2S_HZ;
    timer_conf.freq_hz = freq_in_hz;
    timer_conf.speed_mode = LEDC_HIGH_SPEED_MODE;
    timer_conf.timer_num = LEDC_TIMER_0;
    err = ledc_timer_config(&timer_conf);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ledc_timer_config failed, rc=%x", err);
    }

    ledc_channel_config_t ch_conf;
    ch_conf.channel = LEDC_CHANNEL_0;
    ch_conf.timer_sel = LEDC_TIMER_0;
    ch_conf.intr_type = LEDC_INTR_DISABLE;
    ch_conf.duty = 1;
    ch_conf.speed_mode = LEDC_HIGH_SPEED_MODE;
    ch_conf.gpio_num =  16; //cfg.gpio_clk;  //s_config.pin_xclk; 
    ch_conf.hpoint = 0;
 
    err = ledc_channel_config(&ch_conf);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ledc_channel_config failed, rc=%x", err);
    }
    #endif
}

i2s_parallel_config_t cfg;

// Check this also
// https://github.com/espressif/esp-idf/issues/2251


