Ebiroll/esp32_sigrok/main/collector.c
void setupSimple(void) {

    //buff 0
    dma_descriptor[0].length = 0; //number of byte written to the buffer
    dma_descriptor[0].size = sizeof(dma_buff[0]); //max size of the buffer in bytes
    dma_descriptor[0].owner = 1;
    dma_descriptor[0].sosf = 1;
    dma_descriptor[0].buf = (uint8_t*)&dma_buff[0][0];
    dma_descriptor[0].offset = 0;
    dma_descriptor[0].empty = 0;
    dma_descriptor[0].eof = 0;
    //pointer to the next descriptor
    dma_descriptor[0].qe.stqe_next = &dma_descriptor[1];

    //buff 1
    dma_descriptor[1].length = 0; //number of byte written to the buffer
    dma_descriptor[1].size = sizeof(dma_buff[1]); //max size of the buffer in bytes
    dma_descriptor[1].owner = 1;
    dma_descriptor[1].sosf = 1;
    dma_descriptor[1].buf = (uint8_t*)&dma_buff[1][0];
    dma_descriptor[1].offset = 0;
    dma_descriptor[1].empty = 0;
    dma_descriptor[1].eof = 0;
    //pointer to the next descriptor
    dma_descriptor[1].qe.stqe_next = &dma_descriptor[0];

    //data inputs
    #ifndef UART_TEST_OUTPUT
    //gpio_set_direction(17, GPIO_MODE_INPUT);
    #endif
    gpio_matrix_in(17,    I2S0I_DATA_IN0_IDX, false);
    gpio_set_direction(18, GPIO_MODE_INPUT);
    gpio_matrix_in(18,    I2S0I_DATA_IN1_IDX, false); // 23
    //gpio_set_direction(19, GPIO_MODE_INPUT);
    gpio_matrix_in(15,    I2S0I_DATA_IN2_IDX, false);



    //for i2s in parallel camera input mode data is receiver only when V_SYNC = H_SYNC = H_ENABLE = 1. We don't use these inputs so simply set them High
    gpio_matrix_in(0x38, I2S0I_V_SYNC_IDX, false);
    gpio_matrix_in(0x38, I2S0I_H_SYNC_IDX, false);  //0x30 sends 0, 0x38 sends 1
    gpio_matrix_in(0x38, I2S0I_H_ENABLE_IDX, false);

    // Pixel clock is geneerated from pwm
    gpio_set_direction(22, GPIO_MODE_INPUT);
    gpio_matrix_in(22, I2S0I_WS_IN_IDX, false);  // PXCLK is generated
    
    // Enable and configure I2S peripheral
    periph_module_enable(PERIPH_I2S0_MODULE);

    // Enable slave mode (sampling clock is external)
    I2S0.conf.rx_slave_mod = 1; 
    // Enable parallel mode
    I2S0.conf2.lcd_en = 1;

    // Use HSYNC/VSYNC/HREF to control sampling
    I2S0.conf2.camera_en = 1;
    
    // Configure clock divider
    I2S0.clkm_conf.clkm_div_a = 1;
    I2S0.clkm_conf.clkm_div_b = 0;
    I2S0.clkm_conf.clkm_div_num = 2;
    I2S0.sample_rate_conf.rx_bck_div_num = 2; //i2s clk is divided before reaches BCK output 
       

       
    // FIFO will sink data to DMA
    I2S0.fifo_conf.dscr_en = 1;
    I2S0.fifo_conf.tx_fifo_mod_force_en = 1;
    I2S0.fifo_conf.rx_fifo_mod_force_en = 1;
    // FIFO configuration
    //two bytes per dword packing
    I2S0.fifo_conf.rx_fifo_mod = 1;
    I2S0.conf_chan.rx_chan_mod = 1;
    // Clear flags which are used in I2S serial mode
    I2S0.sample_rate_conf.rx_bits_mod = 0;
    I2S0.conf.rx_right_first = 0;
    I2S0.conf.rx_msb_right = 0;
    I2S0.conf.rx_msb_shift = 0;
    I2S0.conf.rx_mono = 0;
    I2S0.conf.rx_short_sync = 0;
    I2S0.timing.val = 0;


  //Setup I2S DMA Interrupt
  esp_err_t err = esp_intr_alloc( ETS_I2S0_INTR_SOURCE,
                    ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_IRAM,
                    &i2s_trigger_isr,  NULL, &isrHandle);
  
  //Enable the Interrupt
  ESP_ERROR_CHECK(esp_intr_enable(isrHandle));


    //start i2s
    I2S0.rx_eof_num = 0xFFFFFFFF;
    I2S0.in_link.addr = (uint32_t)&dma_descriptor[0];
    I2S0.in_link.start = 1;
    I2S0.int_clr.val = I2S0.int_raw.val;
    I2S0.int_ena.val = 0;

    I2S0.int_ena.val = 1;
    I2S0.int_ena.in_done = 1;

    //start i2s + dma
    I2S0.conf.rx_start = 1;
    gpio_set_level(ledPin, 1);


    vTaskDelay(1000 / portTICK_PERIOD_MS);
    gpio_set_level(ledPin, 0);

    //stop i2s + dma
    //I2S0.conf.rx_start = 0;
}



void setup(void) {


  //WiFi.mode(WIFI_OFF);
  //btStop();
    
  gpio_set_direction(ledPin, GPIO_MODE_OUTPUT);
  dma_desc_init(CAPTURE_SIZE);

  cfg.gpio_bus[0] = 0;
  cfg.gpio_bus[1] = 18; //GPIO01 used for UART 0 RX
  cfg.gpio_bus[2] = 2;
  cfg.gpio_bus[3] = 19; //GPIO03 used for UART 0 TX
  cfg.gpio_bus[4] = 4;
  cfg.gpio_bus[5] = 5;
  cfg.gpio_bus[6] = -1; //GPIO06 used for SCK, bootloop
  cfg.gpio_bus[7] = -1; //GPIO07 used for SDO, bootloop

  cfg.gpio_bus[8] = -1; //GPIO8 used for SDI, bootloop
  cfg.gpio_bus[9] = -1; //GPIO9 lead SW_CPU_RESET on WROOVER module
  cfg.gpio_bus[10] = -1; //GPI10 lead SW_CPU_RESET on WROOVER module
  cfg.gpio_bus[11] = 22; //GPIO11 used for CMD, bootloop
  cfg.gpio_bus[12] = -1; //12;
  cfg.gpio_bus[13] = -1; //13;
  cfg.gpio_bus[14] = -1; // 14;
  cfg.gpio_bus[15] = -1; //15;


  cfg.gpio_clk = 16; // Pin23 used for XCK input from LedC
  cfg.bits = I2S_PARALLEL_BITS_16;
  cfg.clkspeed_hz = 2 * 1000 * 1000; //resulting pixel clock = 1MHz
  cfg.buf = &bufdesc;

  //fill_dma_desc( bufdesc );
  i2s_parallel_setup(&cfg);


}



uint16_t* get_digital_values() {
  //olas
  //return((uint16_t*)s_state->dma_buf[0]);
  //return((uint16_t*)bufdesc.memory);
  return((uint16_t*)dma_buff);
}


uint8_t* get_values() {
  //return((uint16_t*)s_state->dma_buf[0]);
  return((uint8_t*)dma_buff);
}


#endif